{
  "format": "layers-model",
  "generatedBy": "keras v2.8.0",
  "convertedBy": "TensorFlow.js Converter v3.14.0",
  "modelTopology": {
    "keras_version": "2.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "Digit-Recognizer",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 784],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "hidden_layer_1_input"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "hidden_layer_1",
              "trainable": true,
              "batch_input_shape": [null, 784],
              "dtype": "float32",
              "units": 384,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "GaussianNoise",
            "config": {
              "name": "gaussian_noise_3",
              "trainable": true,
              "dtype": "float32",
              "stddev": 0.075,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "output_layer_2",
              "trainable": true,
              "dtype": "float32",
              "units": 10,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "sparse_categorical_crossentropy",
      "metrics": [
        [
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "accuracy",
              "dtype": "float32",
              "fn": "sparse_categorical_accuracy"
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 0.0005034672794863582,
          "decay": 0.0,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "hidden_layer_1/kernel",
          "shape": [784, 384],
          "dtype": "float32"
        },
        { "name": "hidden_layer_1/bias", "shape": [384], "dtype": "float32" },
        {
          "name": "output_layer_2/kernel",
          "shape": [384, 10],
          "dtype": "float32"
        },
        { "name": "output_layer_2/bias", "shape": [10], "dtype": "float32" }
      ]
    }
  ]
}
